{
  "id": "6298a75fba44a12ef902a681",
  "uuid": "a552b730-2914-4f62-aa21-b3c22fd7d449",
  "title": "19 Books Every College Student Should Read",
  "slug": "19-books-every-college-student-should-read-2",
  "html": "<p>Books widen your knowledge. Books make you creative. Books help you learn what no one teaches in school. Books create a new you.</p><p>Everyone should read books to be the best version of themselves. Here’s our list of masterpieces that we think every college student must-read.</p><!--kg-card-begin: html--><table style=\"border:none;border-collapse:collapse;table-layout:fixed;width:451.27559055118115pt\"><colgroup><col></colgroup><tbody><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;background-color:#0b5394;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><h1 dir=\"ltr\" style=\"line-height:1.2;text-align: center;margin-top:8pt;margin-bottom:8pt;\"><span style=\"font-size:20pt;font-family:'Didact Gothic',sans-serif;color:#ffffff;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Self-help</span></h1></td></tr></tbody></table><!--kg-card-end: html--><h2 id=\"the-subtle-art-of-not-giving-a-fck\">The Subtle Art Of Not Giving A F*ck</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/gpxok9BbCpw3oSbdjfE0cXCFDU1JghJ2oh-z0JI2ZS7y3FfB0vUb7j4nCPEKGcQopusSPf3O5weoWAiwFDYe8BekHLO_xX8kqemnvZSrhGtnaZ9SMHJoDFnqv8bIIBOBv53O046eayQNh08YKw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>“The Subtle Art Of Not Giving A F*ck” talks about how you always have to care about something. Therefore, the most important question is, what are you going to care about and why?</p><p>People run for a lot of cultural definitions for success but this book gives the idealogy of what sorts of goals should we have in the first place? What sorts of things should we care about? Hence, moving towards a practical life.</p><p>Key Takeaways from this book are:</p><ul><li>Life isn’t meant to go your way all the time, and that’s OK.</li><li>Pick your battles wisely. Invest your energy where it matters.</li><li>Doing too much is the same as doing nothing at all.</li><li>Failure is a part of life. Failure is how you learn and grow.</li><li>Your fear of failure is your biggest enemy.</li><li>“We can be truly successful only at something we’re willing to fail at. If we’re unwilling to fail, then we’re unwilling to succeed.”</li><li>You can’t ever really “find yourself” because who you are will constantly change, and that’s a good thing.</li><li>Not every “problem” has to be a negative thing.</li><li>“Don’t hope for a life without problems. There’s no such thing. Instead, hope for a life full of good problems.”</li><li>Hard times are a necessary part of life.</li></ul><h2 id=\"atomic-habits\">Atomic Habits</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh3.googleusercontent.com/9YB980cAnALnXOaD2a2pczsp4fxb70JS81AOyGpEc_OoOGT4Yp7zxxVVNnIfsDixx0F7LuPz5fS7xSxEzt2Dp2OX31gz8NX07Ni1Oy0iFlREhYPW8Ka8UmiRkXcUPLFNYTmAzNZptxhggEl3YQ\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>This book stands out the most out of all the habit-building books because of its actionable content. James Clear explains in this book how you do not have to think big, make drastic changes or move mountains to achieve desired outcomes. This book helps you to transform your life by making small changes and tweaks to your daily routine.</p><p>We all tend to underestimate what we can achieve by making small improvements over a long period of time. Real change comes from the repetition of small habits and practices.</p><ol><li>Improving one percent every day will result in being 37 times better by the end of the year. (1.01365 = 37)</li><li>Do not focus on goals. Instead, focus on making systems over time that will improve your lives beyond a single goal.</li><li>How to build a habit of reading books daily?</li><li>Make it obvious - Build <strong>cues </strong>around you - Place Books near your bed.</li><li>Make it attractive -</li><li>Make it easy - Your <strong>response </strong>should be as easy as possible to do. Read just one page or a single chapter or a paragraph.</li><li>Make it satisfying-  Make the <strong>reward </strong>satisfying. Track your progress. Share your learnings to receive feedback.</li></ol><h2 id=\"deep-work\">Deep Work</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/JLs5prhNxw66jqOcCcz0Kqs1gYaFJEs58LtLE7ML43qBupubDaH6sN6jxkvm_POGdHZS5D9jdgB14W3eg3EJLNrzQVIRFAsVhfPYMcw2eVqtX548UYgxRBQFIUfBHTcFu7jE5OfniR-WOF7OPQ\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>This book teaches you how you can achieve more in less amount of time. Many times we do a particular task like studying for hours and hours but in the end, it turns out all the work could have been completed in half of the time that we put in. The rest of the time was just us randomly thinking and doing menial things like using our phones, checking emails, or anything else of our choice. This book helps you to avoid such kind of work, known as, Shallow Work.</p><p>Deep work on the other hand is the ability to spend uninterrupted time and have complete focus on the task at hand.</p><p>A few hours of deep work can accomplish a lot more than hours and hours of shallow work.</p><p>In his book, Cal Newport tells you all about this efficient way of working and how you can achieve such a state.</p><p>A few key takeaways from this book are</p><ol><li>Treat the ability to focus like a muscle. It’s okay if you are not someone with a laser-like focus. Train yourself daily by doing short bursts of tasks with full focus.</li><li>How to do deep work?:</li><li>Choose a Deep Work philosophy</li><li>Schedule deep work blocks</li><li>Decide where and how you’ll perform Deep Work</li><li>Different philosophies of deep work</li><li>Monastic: isolate yourself for long periods of time without distractions; no shallow work is allowed.</li><li>Bimodal: reserve a few consecutive days when you will be working like a monastic (you need at least one day a week)</li><li>Rhythmic: take 3-4 hours every day to perform deep work on your project</li><li>Journalistic: alternate your day between deep and shallow work as it fits your blocks of time (not recommended to try out first)</li></ol><h2 id=\"man%E2%80%99s-search-for-meaning\">Man’s Search for Meaning</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh5.googleusercontent.com/FqchBUY7QFjrKmr0-dH9-pa63-Q1YYwTg0Ppg6BsEmhPi_FdjvGtGxqbEVjltyWNhDqEMZpVPoqEv8Ig_-mTt-Yt-wmxANu0NoSMQDiXprSifXKBK-XuoWO5qyQNTDiQWtvqDXPyo-tBOtXBtg\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>This book is written by Victor Frankl who was a renowned psychiatrist of his time and a holocaust survivor. It tells about his experiences in the Nazi concentration camps, and how he overcame such desperate times and found meaning in his life.</p><p>He is the founder of logotherapy which focuses on helping individuals by finding meaning and purpose in one’s life.</p><p>There are times when we feel lost in difficult times and lose hope, this book tells us the story of a person who overcame such a situation and empowered millions of people through his book.</p><p>There’s a famous saying from his book- “Those who have a ‘why’ to live, can bear with almost any ‘how’.”</p><p>A few takeaways from this book are</p><ol><li>The 3 possible sources of meaning:</li><li>Work, doing something significant</li><li>Love, caring for another person</li><li>Courage during difficult times</li><li>Instead of finding the meaning in life, find value in making every moment valuable.</li><li>Don't judge someone unless you can honestly say in the same situation you wouldn't do that same thing.</li><li>Suffering promotes growth and you can suffer more than you think. Find the positives of overcoming a difficult problem and learn from it.</li></ol><h2 id=\"start-with-why\">Start with Why</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/vl14tF9OWTAct5yPhVTU76XzZXwIJw21YS67PSW4Cb6o7J6yX9vYczim3vtr_iQKQabp9gd0JrGxqOW83kXpu0zEhehdQGjzXazuAjLue5G9Q377xyW92ZxobET4AbUOs-eC8Q2FSeEyc56aLw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>Start with why is a book which will teach you how you can inspire others to achieve remarkable results. Eventually, in your career, you will be required to lead a team, group, or organization.</p><p>According to the book, “There are only two ways to influence human behavior: you can manipulate it or you can inspire it.” People can explain what they do and how they do it, but very few have a clear idea behind why they do it. Those who have a clear “why” never manipulate, they inspire. Knowing your WHY is not the only way to be successful, but it is the only way to maintain lasting success.</p><p>A few key takeaways from this book are</p><ol><li>Excited employees are the best resource for any business.</li><li>“When a WHY goes fuzzy, it becomes much more difficult to maintain the growth, loyalty, and inspiration that helped drive the original success.”</li><li>“No matter where we go, we trust those with whom we are able to perceive common values or beliefs.”</li><li>“Great leaders are those who trust their gut. They are those who understand art before science. They win hearts before minds. They are the ones who start with WHY.”</li><li>People don’t buy ‘what’ you do, they buy ‘why’ you do it.</li><li>Follow the Golden Circle principle</li><li>Why: “Why” is all about your purpose. What is your cause? What do you believe in?</li><li>How: What specific actions can be taken to realize your “Why”.</li><li>What: What do you do. The result of your “Why”.</li></ol><h2 id=\"how-to-win-friends-and-influence-people\">How to Win Friends and Influence People</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh3.googleusercontent.com/TaMehda-_GtBxMuNK3ihR7Bf86Uf8wV-L8lwFMlMevhdkjODNS2FzDjlnL33NbmutAHUKP-lUKQahtofSfxgMk5NRPbOvRMaQUdHp6JdLI_5jdEaVV-Lez4R2Ac_VDJJ0y7qCmCViGvTjJH5dw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p><br></p><p>Though released in 1936, this book is still in the print because of its brief, no fluff lessons. \"How To Win Friends And Influence People\" teaches you a variety of ideas for becoming a likable person, managing your relationships, and convincing others to change their behavior without being invasive.</p><ol><li>Don’t criticize, condemn or complain.</li><li>Give honest, sincere appreciation.</li><li>Become genuinely interested in other people.</li><li>Remember that a person’s name is to that person the sweetest and most important sound in any language.</li><li>Be a good listener. Encourage others to talk about themselves.</li><li>Talk in terms of the other person’s interests.</li><li>Make the other person feel important – and do it sincerely.</li><li>Don’t try to “Win” an argument</li></ol><h2 id=\"the-7-habits-of-highly-effective-people\">The 7 Habits of Highly Effective People</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/hUS5ZOQF35K7Dg4a9fBSFJ8P4PzitCd8PL4MmBULpqKZTUTVlZz_Zst2St17hCSgUpIXiaQVp-NPBKDF1uOZNQD1wOtULV_Q9HzR-qQT__x0QiiULOE7heZ31pxROioihVlPJLOCoRl9tAjnjw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>Stephen R. Covey's book The 7 Habits of Highly Effective People is a self-help book. The main idea of the book is that we must change ourselves in order to change our circumstances, and we must be flexible with our views in order to change ourselves. This book should be read by everyone who is about to start a new journey in their professional lives, whether it’s going to a college or starting a new business.</p><p>The few takeaways from this book are</p><ol><li>Be proactive</li><li>Begin with the end in mind</li><li>Visualize in rich detail what you want your friend, your family, and your colleagues to say about you at your funeral. Since you are not dead yet, start living by these priorities.</li><li>Put first things first</li><li>Organize and execute around your most important priorities.</li><li>Think win/win</li><li>Think of agreements or solutions that are mutually beneficial for both the parties involved in an agreement.</li><li>Seek to understand first, before making yourself understood.</li><li>Before you can offer advice, or suggest solutions to another person in any way, you must seek to deeply understand them and their perspective through empathic listening.</li><li>Learn to synergize</li><li>To put it simply, synergy means “two heads are better than one.” Synergize is the habit of creative cooperation.</li><li>Sharpen the saw</li><li>Sharpen the Saw means preserving and enhancing the greatest asset you have—you. Focus on four parts of yourself, body(exercise, nutrition, rest), heart(having good relationships), mind(reading, writing, learning, study), and spirit(service, values, meditation).</li></ol><!--kg-card-begin: html--><table style=\"border:none;border-collapse:collapse;table-layout:fixed;width:451.27559055118115pt\"><colgroup><col></colgroup><tbody><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;background-color:#0b5394;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><h1 dir=\"ltr\" style=\"line-height:1.2;text-align: center;margin-top:8pt;margin-bottom:8pt;\"><span style=\"font-size:20pt;font-family:'Didact Gothic',sans-serif;color:#ffffff;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Wealth</span></h1></td></tr></tbody></table><!--kg-card-end: html--><h2 id=\"rich-dad-poor-dad\">Rich Dad Poor Dad</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/L-H-46R25JQi_CUS48jL5902yDOXLcy0s1S5aDm-4wCLjiCj3gjvStS4At9oPbA4ErXzSk78vOS1eJUZE04hqvA53Djh6fNA4K0iNtD5XZwgzezjZcr5ZrpK1tPddDoVGCRbfGScRz6ULRxn3w\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>Rich Dad Poor Dad is a classic that promises to give the “financial intelligence” that you probably missed out on while growing up. The secrets that wealthy families pass on from generation to generation. By applying the principles given in this book you can get out of the rat race of money-making or even better, never be part of it.</p><p>The book tells you that you do not need to earn a high income to become rich.</p><p>A few takeaways from this book are</p><ol><li>There is a difference between being broke and being poor. Broke is temporary, poor is eternal.</li><li>“Money comes and goes, but if you have the education about how money works, you gain power over it and can begin building wealth.”</li><li>“Most people don’t understand why they struggle financially because they don’t understand cash flow.”</li><li>Once you understand the difference between assets and liabilities, concentrate your efforts on buying income-generating assets.</li><li>“Wealth is a person’s ability to survive so many numbers of days forward—or, if I stopped working today, how long could I survive?”</li><li>“For people who hate real estate, they shouldn’t buy it.”</li></ol><h2 id=\"the-psychology-of-money\">The Psychology of Money</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/YPN1Ooh9_Kkm827BM8BFaHgNL1DQDFMPuTcDZsvtkUsD9s6vNgreFKjaDf0yVw943C7Tuy0_9tBLHuhl_fq8usKzwRmp_6sfJEZ1bqFRJ7AfpDFNtWEnKkMCucIoWvSMpRoPi4J2kn8mzCboqw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>We human beings are irrational and no amount of theoretical knowledge can compete with the actual practical knowledge that we can gain through experience. You may think that you can hold your stocks during a 30% down market. This is because you know that only losers sell their stock so low. But it’s only when you experience that type of market that you’ll learn what you’ll actually do.</p><p>The Psychology of Money is about the strange ways people think about wealth, greed, and happiness. This book goes beyond the conventional financial content like how to select stocks or what kind of assets to buy, this book shapes your mind for a better relationship with money eventually leading you to live a more prosperous life. Everyone should read this book at the start of their career for a better understanding of their relationship with money.</p><p>A few key takeaways from this book are</p><ol><li>All the money in the world is pointless if you don’t have the time or the health to enjoy it.</li><li>“The ability to do what you want, when you want, with who you want, for as long as you want, is priceless. It is the highest dividend money pays.”</li><li>Good investing is not about making good decisions. It’s about consistently not screwing up.</li><li>You can be wrong half the time and still make a fortune.</li><li>No one is impressed by your possessions as much as you are.</li><li>Building wealth has little to do with your income or investment returns, and lots to do with your savings rate.</li><li>Past a certain level of income, what you need depends only on your ego.</li><li>One of the single most important things you can do as an investor waits, or extend your time horizon.</li></ol><h2 id=\"the-richest-man-in-babylon\">The Richest Man in Babylon</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/H8lSayll5f2bM65zaIBeSwHJySWoppqSYMhfXBbUfwWM1qeOp7aMjG3kfER0UNE7-OtBaxxPazFzFhIkO30sPuKl71TYUfpkLxddVt4e3yR-QjamY5iT8qmTP3cCZ3IBuraJJZDD29l93tLzHA\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>This book tells a story set in Babylon during ancient times. It’s a story with a lesson in it (known as parables). A young man asks a rich man to mentor him and the whole book revolves around their conversations. The young man eventually gets rich by applying all the wisdom told by his mentor but after making mistakes and correcting them. The principles that the rich man teaches his young mentee are timeless and classic and are applicable to even this day.</p><p>A few takeaways from this book are:</p><ol><li>Start thy purse to fattening: save money.</li><li>Control thy expenditures: don't spend more than you need.</li><li>Make thy gold multiply: invest wisely.</li><li>Guard thy treasures against loss: avoid investments that sound too good to be true.</li><li>Make of thy dwelling a profitable investment: own your home.</li><li>Ensure a future income: protect yourself with life insurance.</li><li>Improve thy ability to earn: strive to become wiser and more knowledgable.</li><li>The laws of money are like the laws of gravity: assured and unchanging.</li><li>Money is plentiful for those who understand the simple laws of making money.</li><li>Babylon was the wealthiest city in the world at the time of its height because its people appreciated the value of money.</li></ol><h2 id=\"the-millionaire-next-door\">The Millionaire Next Door</h2><p><br></p><p>Do you have what it takes to be a millionaire? If not, this book will show you what exactly one needs to be one. Instead of telling you how to become wealthy, this book tells the story of thousands of people who have already become millionaires.<br></p><p>The authors of this book, William Danko and Thomas Stanley, when first started research for this book, discovered something odd, people who live in expensive homes and drive luxury cars do not actually have much wealth.</p><p>Then they discovered something even odder: Many people who have a great deal of wealth do not even live in upscale neighborhoods. <br></p><p>After reading this book you will have a sure-shot idea about what kind of habits you should develop from an early stage so that eventually you can become wealthy, or in this case, a millionaire.<br></p><p>The book’s authors discovered seven common habits among the people who are actually wealthy and not just rich:</p><p>1. They live well below their means.</p><p>2. They allocate their time, energy, and money efficiently, in ways conducive to building wealth.</p><p>3. They believe that financial independence is more important than displaying high social status.</p><p>4. Their parents did not provide <a href=\"https://themillionairenextdoor.com/2011/12/economic-outpatient-care/\">economic outpatient care.</a></p><p>5. Their adult children are economically self-sufficient.</p><p>6. They are proficient in targeting market opportunities.</p><p>7. They chose the right occupation.<br></p><!--kg-card-begin: html--><table style=\"border:none;border-collapse:collapse;table-layout:fixed;width:451.27559055118115pt\"><colgroup><col></colgroup><tbody><tr style=\"height:0pt\"><td style=\"border-left:solid #000000 1pt;border-right:solid #000000 1pt;border-bottom:solid #000000 1pt;border-top:solid #000000 1pt;vertical-align:top;background-color:#0b5394;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><h1 dir=\"ltr\" style=\"line-height:1.2;text-align: center;margin-top:8pt;margin-bottom:8pt;\"><span style=\"font-size:20pt;font-family:'Didact Gothic',sans-serif;color:#ffffff;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Health</span></h1></td></tr></tbody></table><!--kg-card-end: html--><p></p><h2 id=\"why-we-sleep\">Why We Sleep</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/jBzBI0tJcRQ-9gSRwMm9ZTOjYCPgJdTc1a11BzRs9UGQO8M3gwYoOUIB3GqHz53ZVBG7dhU0UOe0gmPAJo20CMEF6uu3OqL_crZISPG-IyZlQoUBXaiMGNc2VGhTBv27Rrla5g0_xesDbY7GnA\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>In case you didn’t know why sleep was important, this book makes that clear. Sleep is vital to our health and has the ability to make us smarter, more attractive, slimmer, and happier.</p><p>The author, Matthew Walker,  warns us of the consequences of sleep deprivation, explains the amazing world of dreams, and gives us reliable and practical advice to get more hours of sleep.</p><p><em>“Back in my early Microsoft days, I routinely pulled all-nighters when we had to deliver a piece of software. Once or twice, I stayed up two nights in a row. I knew I wasn’t as sharp when I was operating mostly on caffeine and adrenaline, but I was obsessed with my work, and I felt that sleeping a lot was lazy.</em></p><p><em>Now that I’ve read Matthew Walker’s Why We Sleep, I realize that my all-nighters, combined with almost never getting eight hours of sleep, took a big toll.”</em></p><p>- Bill Gates, Co-Founder of Microsoft.</p><p>This is a book of science with all the facts and information but the author has turned this into an absolute page-turner by explaining concepts easily. He explains what is sleep, why we dream, what makes us sleepy and every other question and concept that exists on the topic.</p><p>A few takeaways from this book are</p><ol><li>Getting adequate quality sleep is even more important than food and exercise for our physical and mental health</li><li>Humans have a relatively large amount of REM sleep compared to other animals, which smooths our emotional circuits and fuels creativity.</li><li>Getting a good night's sleep gets more challenging as we become older, but it's still important.</li><li>Learning benefits from sleep. It makes room for fresh memories and aids in the recall of new information.</li><li>It's hard to \"make up\" for sleep deprivation.<br></li></ol><!--kg-card-begin: html--><table style=\"border:none;border-collapse:collapse;\"><colgroup><col width=\"600\"></colgroup><tbody><tr style=\"height:35.25pt\"><td style=\"border-left:solid #000000 0.99609pt;border-right:solid #000000 0.99609pt;border-bottom:solid #000000 0.99609pt;border-top:solid #000000 0.99609pt;vertical-align:top;background-color:#0b5394;padding:5pt 5pt 5pt 5pt;overflow:hidden;overflow-wrap:break-word;\"><h1 dir=\"ltr\" style=\"line-height:1.2;text-align: center;margin-top:8pt;margin-bottom:8pt;\"><span style=\"font-size:20pt;font-family:'Didact Gothic',sans-serif;color:#ffffff;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Startups</span></h1></td></tr></tbody></table><!--kg-card-end: html--><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/wmFJnAOJFDjMG5JifRV0xvhkAG8dMsgOcsmN7RtPOXML3lUKYgBpm7Fm6RUiu4VUUkJ8c-ye9zlvzOQbfFOkFD6ZMkJy2ayOftvPLzhTetIrIuKuXbXthb7F4m4b04HlgWmMo-81h29bduxG-g\" class=\"kg-image\" alt loading=\"lazy\"></figure><h2 id=\"zero-to-one\">Zero to One</h2><p>Peter Thiel becomes a chess master under age 21, a doctorate in law by age 25, and sold a company(PayPal) for $1.5 billion at age 35. He is part of the Paypal Mafia which includes people like Elon Musk and <a href=\"https://www.google.com/search?q=reid+hoffman&amp;rlz=1C1YTUH_enIN1006IN1006&amp;oq=Reid+Hoffman&amp;aqs=chrome.0.0i355i512j46i512j0i512l5j69i60.221j0j9&amp;sourceid=chrome&amp;ie=UTF-8\">Reid Hoffman</a>. He was the first outside investor in Facebook and bought a 10.2% stake for 5 million dollars and later sold them for more than a billion dollars.</p><p>Zero To one will teach you the way he thinks, how he approaches business, and what you can do to build your startup’s own future and shape the future of the world in the process.</p><p>He covers the importance of strong foundations, team culture, and persistence. However, he also encourages companies to think outside the box and build a monopoly based on innovation rather than copying others.</p><p>A few takeaways from this book are</p><ol><li>Each moment in business happens only once. The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won’t make a search engine. If you are copying these guys, you aren’t learning from them.</li><li>A formula (for innovation) cannot exist; because every innovation is new and unique, no authority can prescribe in concrete terms how to be more innovative.</li><li>Successful people find value in unexpected places, and they do this by thinking about business from first principles instead of formulas.</li><li>Monopolies are good. They drive innovation, drive progress, and drive profits.</li><li>The value should be determined by what the company will make over its lifetime not in the first few years.</li><li>Being the first mover in the market doesn’t do you any good if someone else comes along and unseats you. It’s much better to be the last mover, that is, to make the last great development in a specific market and enjoy years or even decades of monopoly profits.</li></ol><h2 id=\"the-lean-startup\">The Lean Startup</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/c3s_puS26z-4qUpxIuekD67TQxrUQ_P5TdF5SrhftFPUIiIzfCwE5GKhYFwMC4vgO1vNVOiI9ZFQvCcRY4dIDdl3LtFDPMXJlqvIZ3Vimy19T1wDFaYIX4remaHXscI5K-lpohmwSuR0svv9BQ\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>The Lean Startup teaches entrepreneurs to test, learn, and adapt their strategy through a cycle of continuous improvement, rather than developing complicated business plans.</p><p>This book discusses a new approach that startups can use to increase their likelihood of success.</p><p>By following these guidelines, startups can increase their chances of success. </p><p>A few key takeaways from this book are</p><ol><li>There is a process to entrepreneurship that can be learned.</li><li>The goal of a startup is to figure out the right thing to build – the thing customers want and will pay for – as quickly as possible.</li><li>Customers do not tell us what they want. They reveal the truth through their action or inaction.</li><li>Use MVPs to cycle through the Build-Measure-Learn feedback loop as fast as possible.</li><li>Build-measure-learn (BML) is a process of building a product, measuring consumer metrics, and learning from them to better respond to customer needs and improve the product for the sustainability of the company.</li></ol><h2 id=\"the-four-hour-work-week\">The Four Hour Work Week</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/Iph7Aw69wwJhbJepbhYnCqHAZrCDS92nAb7BnCBhwqhBnz8ObzrTtaGtMi0HL2_JNI2GcUERwVf12BWekbkghUDXZ2UvUXAu-Sm310oKPXMuv_vG-nS7tEFWJCFFfu-IQShjS_XFOdIbJW1SPw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p><br>Tim Ferriss wrote ‘The 4-Hour Work Week’ for all those tired of postponing their dreams until retirement.</p><p>Ferriss states that people don’t want to be millionaires; they want to experience what they think only millionaires can buy. The question, therefore, is how can you achieve the lifestyle of a millionaire, without having a million dollars in the bank?</p><p>A few key takeaways from this book are.</p><p>Ten rules for you to be part of the “New Rich”:</p><ol><li>Retirement rests on the assumption that you are doing something you dislike for the healthiest years of your life rather than enjoying those years now.</li><li>Interest and energy are cyclical. Alternating between periods of rest and activity is essential.</li><li>Less is not laziness. Despite spending fewer hours in the office, the New Rich produces more meaningful results than an average worker.</li><li>The timing is never right. Waiting for ‘someday’ means that you will take your dreams to the grave.</li><li>Emphasize strengths. Don’t fix weaknesses.</li><li>When things are done to excess, they often take on the characteristics of their opposites. Too much and too often of what you want will soon become what you don’t want.</li><li>Money alone is not the solution.</li><li>Relative income is more important than absolute income.</li><li>Distress is bad, eustress is good. Distress refers to harmful stress that makes you weaker. Eustress refers to the type of stress that helps you grow.</li></ol><h2 id=\"good-to-great\">Good to Great</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/UB5g_tRLkQkj9sRUdFvCkP9OgPYdb8o-9u71Fn13nFygw70jB2CG0BYCmjiHxlZojfeJZoTLo0Eg6INrf3J4-nyFbDokl_HpMkfYbPUPrlP5mYk1aL2XWAv29W2uz9rcNGqLrP20sZIiLZWxHA\" class=\"kg-image\" alt loading=\"lazy\"></figure><p><br></p><p>Good to Great focuses on how both mediocre and good companies can go beyond their stagnant status to become great organizations.</p><p>Jim and his team looked at companies that went from average performance to beat the stock market over the course of 30 years. He divided them into three categories: \"good-to-great,\" \"direct comparison,\" and \"un-sustained comparison.\"</p><p>The end result is a collection of tactics, habits, and practices that can transform a good company into a great one.</p><p>A few key takeaways from this book are</p><ol><li>Following the Hedgehog concept, ask yourselves these questions</li><li>What you are deeply passionate about</li><li>What you can be the best in the world at</li><li>What best drives your economic or resource engine</li><li>First who, Then what</li><li>Those who build great organizations make sure they have the right people on the bus and the right people in the key seats before they figure out where to drive the bus.</li></ol><h2 id=\"the-courage-to-be-disliked\">The Courage To Be Disliked</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/0JIWmAR_dfbjT_h1uOVfkBfrqkYnk50I2YPC1HYI_t9e_dAIosK_EHw6M1J9y8xNYICT7hLYSv3lUctcSjnI3zX-SshYrgQLyMUljQq69SUBHzwQDLtkOp8EMl6NdK2ZQmipAi2HGcqpOWXWcw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>The Courage To Be Disliked is an analysis of the work of 19th-century psychologist Alfred Adler, whose research says that happiness lies in the hands of each human.</p><p>The book depicts a conversation between a philosopher and a cynical youth who has been struggling with self-acceptance and has a general dislike of the world.</p><p>One controversial point in Adlerian philosophy is that there is no such thing as trauma.</p><p>In Adler’s words,</p><p><em>“No experience is in itself a cause of our success or failure, we do not suffer from the shock of our experience but instead, we make out of them whatever suits our purposes. We are not determined by our experiences but the meaning we give them is self-determining”</em></p><p>In short, the self is determined not by our experiences but by the meaning that we give them.</p><p>A few key takeaways from this book are</p><ol><li>Loneliness is when you are surrounded by other people, society, and community but feel deeply disconnected from them.</li><li>Your life is not something you are given; rather, it is something you decide for yourself, and you are in charge of how you live.</li><li>One has to stand on one’s own two feet and take one’s own steps forward with the tasks of interpersonal relations. One needs to think not, What will this person give me? but rather, What can I give to this person? That is a commitment to the community.</li><li>Whatever has happened in your life up to this point should have no influence on how you live in the future.</li><li>Your unhappiness cannot be blamed on your past or your environment. And it isn’t that you lack competence. You just lack courage. One might say you are lacking in the courage to be happy.</li></ol><h2 id=\"21-laws-of-leadership\">21 Laws of Leadership</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh3.googleusercontent.com/Jakj7jBpQOvftem2eKgQe-q4tVHpIGIoGOqKhYV4CXEXpt0TqNmM4JnPbNPDwYVlb84X7PP6dosoZ6S4mI8X91P63pVg_Spy44pH_3Gb-054uT6bMxQ2IKGmBGK6OH68oAaC577wQuCOJW25aw\" class=\"kg-image\" alt loading=\"lazy\"></figure><p><br>If you want to make a positive impact in this world, one thing will definitely help, and that is your leadership ability.</p><p>This book shows you that leadership is learned not inherited and you can become a leader too.</p><p>He used the 21 laws to train tens of thousands of leaders, including executives at Fortune 500 companies, government officials, and students and faculty at universities.</p><p>A few takeaways from this book are</p><ol><li>Leadership ability determines a person’s level of effectiveness.</li><li>The true measure of leadership is influence – nothing more, nothing less.</li><li>Leadership develops daily, not in a day.</li><li>Anyone can steer the ship, but it takes a leader to chart the course.</li><li>Leaders add value by serving others.</li><li>Trust is the Foundation of Leadership.</li><li>People naturally follow leaders stronger than themselves.</li><li>Who you are is who you attract.</li><li>Leaders evaluate everything with a leadership bias.</li><li>Only secure leaders give power to others.</li></ol><h2 id=\"no-rules-rule\">No Rules Rule</h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/YJ2-UBh5v8eruRT48y0rkzWFY5NMq1gCqyTyKePkYTmb_bzfj2cSzoxny52EVnTNhcEuPV2CkMa5RRv3klpCIfPKik75HOe167goim-cYFQAo0KTC63ZiofWUPspe4uu5lCAMIca2Jrk11gToA\" class=\"kg-image\" alt loading=\"lazy\"></figure><p>No Rules Rules explain the unique and efficient company culture of Netflix. It explains the amazing levels of freedom and responsibility Netflix gives to its employees and how this innovative way of running the business is the very reason that Netflix is so successful.</p><p>Most companies tend to get more rules and processes as they grow larger. Netflix has excelled by going in the opposite direction. As the company has grown, it has built a culture of having fewer rules, not more.</p><p>Reed Hastings, the co-founder of Netflix, CEO, and the author of this book outlines how he cultivated a unique work environment.</p><p>If you are looking for a way to shake up your company’s work style, you may find some of these concepts useful.<br>A few key takeaways from this book are</p><ol><li>Inside a corporation, high performance is addictive. Everyone will be competent if you have excellent performers. If you have a team of solely top performers, everyone will perform in the same manner.</li><li>Great companies figure out how to get rid of limitations. This attracts exceptional talent, who require fewer and fewer controls in any case. It's a constant cycle that keeps repeating itself.</li><li>For a big idea, test it out - it is important to test out ideas even if the leaders don't believe in the idea - the team should feel comfortable testing out ideas.<br></li></ol>",
  "comment_id": "6298a75fba44a12ef902a681",
  "feature_image": "https://images.unsplash.com/photo-1495446815901-a7297e633e8d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGJvb2tzfGVufDB8fHx8MTY1NjY4OTg0NQ&ixlib=rb-1.2.1&q=80&w=2000",
  "featured": false,
  "visibility": "public",
  "email_recipient_filter": "none",
  "created_at": "2022-06-02T17:34:47.000+05:30",
  "updated_at": "2022-07-01T21:07:32.000+05:30",
  "published_at": "2022-06-02T17:59:22.000+05:30",
  "custom_excerpt": null,
  "codeinjection_head": null,
  "codeinjection_foot": null,
  "custom_template": null,
  "canonical_url": null,
  "tags": [],
  "authors": [
    {
      "id": "624e9c5bba44a12ef902a294",
      "name": "The Internet Folks",
      "slug": "tif",
      "profile_image": "https://blog.internetfolks.in/content/images/2022/05/Icon.png",
      "cover_image": null,
      "bio": null,
      "website": null,
      "location": null,
      "facebook": null,
      "twitter": null,
      "meta_title": null,
      "meta_description": null,
      "url": "https://blog.internetfolks.in/author/tif/"
    }
  ],
  "primary_author": {
    "id": "624e9c5bba44a12ef902a294",
    "name": "The Internet Folks",
    "slug": "tif",
    "profile_image": "https://blog.internetfolks.in/content/images/2022/05/Icon.png",
    "cover_image": null,
    "bio": null,
    "website": null,
    "location": null,
    "facebook": null,
    "twitter": null,
    "meta_title": null,
    "meta_description": null,
    "url": "https://blog.internetfolks.in/author/tif/"
  },
  "primary_tag": null,
  "url": "https://blog.internetfolks.in/19-books-every-college-student-should-read-2/",
  "excerpt": "Books widen your knowledge. Books make you creative. Books help you learn what\nno one teaches in school. Books create a new you.\n\nEveryone should read books to be the best version of themselves. Here’s our list\nof masterpieces that we think every college student must-read.\n\nSelf-help\nThe Subtle Art Of Not Giving A F*ck\n“The Subtle Art Of Not Giving A F*ck” talks about how you always have to care\nabout something. Therefore, the most important question is, what are you going\nto care about and why?",
  "reading_time": 18,
  "access": true,
  "og_image": null,
  "og_title": null,
  "og_description": null,
  "twitter_image": null,
  "twitter_title": null,
  "twitter_description": null,
  "meta_title": null,
  "meta_description": null,
  "email_subject": null,
  "frontmatter": null,
  "feature_image_alt": null,
  "feature_image_caption": "Photo by <a href=\"https://unsplash.com/@tomhermans?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Tom Hermans</a> / <a href=\"https://unsplash.com/?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Unsplash</a>"
}
